In [7]:
import pandas as pd
import numpy as np

# Assignment 1: DataFrame Basics

Read in the transactions dataset and report on:

* The number of rows and columns
* The names of the columns
* The datatypes of each column

In [8]:
# A common practice is to create a path variable to pass to read_csv
path = "../../Data/transactions.csv"

transactions = pd.read_csv(path)

transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [9]:
# shape of df: 84388 rows, 3 columns 
transactions.shape

(83488, 3)

In [10]:
# shape of df: 84388 rows. Add 1 to max default index value to get row count
transactions.index.max() + 1

83488

In [11]:
# dtypes attribute returns column names and their data types
transactions.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

# Assignment 2: Exploring DataFrames

* Inspect the first 5 rows of the transactions data
* Check if there are any missing values.
* What is the number of unique dates?
* Report the mean, median, min and max of “transactions”?

In [12]:
# Look at top 5 rows with .head()
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [13]:
# get missing counts for all columns

transactions.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [14]:
# Use info to determine missing counts
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [15]:
# Use describe to return statistical info
transactions.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [16]:
# Method 1 for unique dates
transactions["date"].nunique()

1682

In [17]:
# Method 2 for unique dates - speecify include="all" to get stats on text columns.

transactions.describe(include="all")

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-08-15           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

# Exercise 3 - Accessing DataFrames

The first row is the only one from 2013-01-01.

* Get a copy of the DataFrame that excludes that row, and only includes “store_nbr” and “transactions”?
* Report the number of unique store numbers
* Return the total number of transactions in millions

In [18]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [19]:
# skip the first row via slicing

transactions.loc[1:, "store_nbr":"transactions"]

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [20]:
# calculate sum of store number column

transactions.loc[:, "store_nbr"].nunique()

54

In [21]:
# Divide sum of transactions by millions to get in units of millions

transactions.loc[:, "transactions"].sum() / 1000000

141.478945

# Assignment 4: Missing Data

Can you tell if any dates or prices are missing in the oil dataset?

Then compare the mean of the oil series when filling in with mean vs. filling in with 0.

In [22]:
oil = pd.read_csv("../../Data/oil.csv")

In [23]:
# info can be used to infer missing counts 1218 - 1175 = 43

oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [24]:
# But usually easier to use isna().sum() - let the computer count for you :D

oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [25]:
# calculate mean of oil series after filling missing values with 0

oil.loc[:, 'dcoilwtico'].fillna(0).mean()

65.32379310344835

In [26]:
# calculate mean of oil series after filling missing values with the mean of oil price

oil.loc[:, 'dcoilwtico'].fillna(oil.loc[:, 'dcoilwtico'].mean()).mean()

67.71436595744696

# Assignment 5: Filtering DataFrames

On store 25:

* Calculate the percentage of times ALL stores had more than 2000 transactions
* Calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days

Then:
* Sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions

In [27]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [28]:
# all stores > 2500 percentage occurence

(transactions['transactions'] > 2000).mean()

0.26680481027213493

In [29]:
# Number of times store 25 had > 2000 divided by total days for store 25 to get percent of time it happened

mask = (transactions['transactions'] > 2000) & (transactions['store_nbr'] == 25)

(transactions.loc[mask, 'transactions'].count() 
 / transactions.loc[(transactions['store_nbr'] == 25), 'transactions'].count())

0.0346749226006192

In [30]:
# Sum of transactions where store 25 had > 2000 transactions

transactions.loc[mask, 'transactions'].sum()

144903

In [31]:
# sum of transactions for stores 25 and 31 in months May and June on days they had less than 2000 transactions

(transactions.query(
    "store_nbr in [25, 31] & date.str[6] in ['5', '6'] & transactions < 2000")
 .loc[:, "transactions"]
 .sum())

644910

# Assignment 6: Sorting DataFrames

* Get a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
* Get  a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
* Finally, sort the columns in reverse alphabetical order.

In [32]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [33]:
# sort dataframe by values in transaction column in descending order (ascending = False)
# then grab first 5 rows to retrieve 5 highest days

transactions.sort_values('transactions', ascending=False).iloc[:5, :]

             date  store_nbr  transactions
52011  2015-12-23         44          8359
71010  2016-12-23         44          8307
16570  2013-12-23         44          8256
33700  2014-12-23         44          8120
16572  2013-12-23         46          8001

In [34]:
# Sort dataframe by date in ascending order, and trasactions in descending order

transactions.sort_values(['date', 'transactions'], ascending=[True, False])

             date  store_nbr  transactions
0      2013-01-01         25           770
40     2013-01-02         46          4886
38     2013-01-02         44          4821
39     2013-01-02         45          4208
41     2013-01-02         47          4161
...           ...        ...           ...
83455  2017-08-15         22           766
83449  2017-08-15         16           742
83465  2017-08-15         32           615
83468  2017-08-15         35           612
83459  2017-08-15         26           534

[83488 rows x 3 columns]

In [35]:
# sort columns in reverse alphabetical order using sort_index on the column axis (1), in descending order

transactions.sort_index(axis=1, ascending=False)

       transactions  store_nbr        date
0               770         25  2013-01-01
1              2111          1  2013-01-02
2              2358          2  2013-01-02
3              3487          3  2013-01-02
4              1922          4  2013-01-02
...             ...        ...         ...
83483          2804         50  2017-08-15
83484          1573         51  2017-08-15
83485          2255         52  2017-08-15
83486           932         53  2017-08-15
83487           802         54  2017-08-15

[83488 rows x 3 columns]

# Assignment 7: Column Creation

Just some quick work, but can you send me the transaction data with the columns renamed?

* Create a `pct_to_target` column that divides transactions by 2500.
* Then, create a `met_target` column that returns True if `pct_to_target` is greater than or equal to 1.
* Next, create a `bonus_payable` column that equals 100 if `met_target` is True, and 0 if not. Then sum the bonus payable column.

In [36]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [38]:
# target based columns
transactions["pct_to_target"] = transactions.loc[:, "transactions"] / 2500
transactions["met_target"] = transactions.loc[:, "pct_to_target"] >= 1
transactions["bonus_payable"] = 100 * transactions["met_target"]

transactions.head()

,date,store_nbr,transactions,pct_to_target,met_target,bonus_payable
0,2013-01-01,25,770,0.3080,False,0
1,2013-01-02,1,2111,0.8444,False,0
2,2013-01-02,2,2358,0.9432,False,0
3,2013-01-02,3,3487,1.3948,True,100
4,2013-01-02,4,1922,0.7688,False,0

In [39]:
# Call sum on "bonus_payable" column to get total sum of bonus paid

transactions.loc[:, "bonus_payable"].sum()

1448300